N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
/*! *********************************************************************************
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* Copyright 2016-2020 NXP
* All rights reserved.
*
* \file
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

/*****************************************************************************
 *                               INCLUDED HEADERS                            *
 *---------------------------------------------------------------------------*
 * Add to this section all the headers that this module needs to include.    *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
#include "EmbeddedTypes.h"
#include "PWR_Configuration.h"
#include "PWRLib.h"
#include "PWR_Interface.h"
#include "TimersManager.h"
#include "fsl_device_registers.h"
#include "fsl_os_abstraction.h"
#include "fsl_lptmr.h"
#include "board.h"
#include "clock_config.h"
#include "DCDC.h"
#include "Keyboard.h"
#include "SerialManager.h"
#if defined(gAppUseNvm_d) && (gAppUseNvm_d==1)
#include "NVM_Interface.h"
#endif
//#include "gap_interface.h"   // for Gap_GetBondedDevicesCount() for debugging

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
#include "controller_interface.h"
#include "TMR_Adapter.h"
#endif

#include "nxp2p4_xcvr.h"

/*****************************************************************************
 *                             PRIVATE MACROS                                *
 *---------------------------------------------------------------------------*
 * Add to this section all the access macros, registers mappings, bit access *
 * macros, masks, flags etc ...                                              *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
#define mBLETimoutMaxMs_c       40959U
#define mPWR_DSM_TimerMask_c    (0xffffffU)
#define mPWR_DSM_InvalidTime_c  (0xffffffffU)
#define mPWR_DSM_MaxTimeCount_c (0x1000000U)

#ifndef VECTOR_PENDING
#define VECTOR_PENDING (((*((volatile uint32_t*)0xE000ED04U))>>12)&0x3fU)
#endif

#if (defined(__ICCARM__))
#define AT_WARMBOOTCONFIG_SECTION(var) var @"WarmbootConfig"
#elif(defined(__CC_ARM))
#define AT_WARMBOOTCONFIG_SECTION(var) __attribute__((section("WarmbootConfig"), zero_init)) var
#elif(defined(__GNUC__))
#define AT_WARMBOOTCONFIG_SECTION(var) __attribute__((section("WarmbootConfig"))) var
#else
#error Toolchain not supported.
#endif

#ifndef DUMP_EVERY_X_TIMES
#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
#define DUMP_EVERY_X_TIMES      1
#else
#define DUMP_EVERY_X_TIMES      3
#endif
#endif

#if (!defined(GCOV_DO_COVERAGE) || (GCOV_DO_COVERAGE == 0))
#define PWR_NOP    PWR_ExecuteNop()
#define PWR_STATIC static
#define PWR_PUBLIC
#else
#define PWR_NOP    break
#define PWR_STATIC __WEAK
#define PWR_PUBLIC __WEAK
#endif


#if (cPWR_BLE_LL_Enable)
/* LLS3 + BLE DSM wakeup on the first next instant by BLE timer */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_1   (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_DSM_AUTO_WKUP_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* LLS3 + BLE idle wakeup on deepSleepTimeInMs by LPTMR */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_2_3 (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_DSM_INT_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* VLLS0 + BLE idle wakeup by keyboard */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_4   (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_DSM_INT_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* VLLS2 + BLE idle wakeup by keyboard */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_5   (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_DSM_INT_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* STOP wakeup on deepSleepTimeInMs by LPTMR */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_6   (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/*  LLS3  + GENFSK_LL in DSM. */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_7   (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* VLLS2/3 + BLE LL in DSM shutdown, wakeup on the first next instant by BLE timer */
#define BLE_LL_CLOCK_CONFIG_LP_MOD_8   (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_DSM_AUTO_WKUP_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

/* Default clock config used when going into Sleep mode */
#define BLE_LL_CLOCK_CONFIG_DEFAULT    (BLE_LL_CLOCK_CONFIG_DSM_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_SYS_CLK_GATE_EN_MASK | \
                                       BLE_LL_CLOCK_CONFIG_LPO_FREQ_SEL_MASK)

#endif /* (cPWR_BLE_LL_Enable) */

#define OFFSET_BEFORE_DSM_EXIT(__wakeup_offset, __osc_startup_delay)    ((uint16_t)(\
                   (__wakeup_offset)                                               \
                 + (((osc_startup_delay) & BLE_LL_WAKEUP_CONFIG_OSC_DELAY_SLOT_MASK) >> BLE_LL_WAKEUP_CONFIG_OSC_DELAY_SLOT_SHIFT) \
                 + 1U))

#define WAKEUP_CFG_OSC_STARTUP_DELAY(__wakeup_offset, __osc_startup_delay) ((uint16_t)(\
                 (((__wakeup_offset) << BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_SHIFT) & BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_MASK) |        \
                 (((__osc_startup_delay) << BLE_LL_WAKEUP_CONFIG_OSC_DELAY_SHIFT)& BLE_LL_WAKEUP_CONFIG_OSC_DELAY_MASK)         \
                   ))

#define PWR_SERIAL_IF_INVALID          0xFFU
#define PWR_NEXT_INSTANT_INVALID       0xFFFFU

/*****************************************************************************
 *                               PUBLIC VARIABLES                            *
 *---------------------------------------------------------------------------*
 * Add to this section all the variables and constants that have global      *
 * (project) scope.                                                          *
 * These variables / constants can be accessed outside this module.          *
 * These variables / constants shall be preceded by the 'extern' keyword in  *
 * the interface header.                                                     *
 *---------------------------------------------------------------------------*
 *****************************************************************************/

/*****************************************************************************
 *                           PRIVATE FUNCTIONS PROTOTYPES                    *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions prototypes that have local (file)   *
 * scope.                                                                    *
 * These functions cannot be accessed outside this module.                   *
 * These declarations shall be preceded by the 'static' keyword.             *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
#if (cPWR_UsePowerDownMode)
#if (cPWR_EnableDeepSleepMode_1 || cPWR_EnableDeepSleepMode_2 || cPWR_EnableDeepSleepMode_3)
static void PWR_HandleDeepSleepMode_1_2_3(void);
#endif
#if cPWR_EnableDeepSleepMode_4
static void PWR_HandleDeepSleepMode_4(void);
#endif
#if cPWR_EnableDeepSleepMode_6
static void PWR_HandleDeepSleepMode_6(void);
#endif
#if cPWR_EnableDeepSleepMode_7
static void PWR_HandleDeepSleepMode_7(void);
#endif
#if (cPWR_EnableDeepSleepMode_8 || cPWR_EnableDeepSleepMode_5)
static void PWR_HandleDeepSleepMode_5_8(void);
#endif
#if (cPWR_EnableDeepSleepMode_9)
static void PWR_HandleDeepSleepMode_9(void);
static void PWR_BLE_LL_ResetRestartAdv(void);
#if defined(gPWR_RamOffRestoreBonding_d) && (gPWR_RamOffRestoreBonding_d == 1)
static void PWR_RestoreBondingFromRamOff(void);
#endif
#endif

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
static bool_t PWR_CheckBLE_LL_state(uint16_t * nextInstant, bool_t * requireDsmEntry, uint16_t offsetBeforeDsmExit);
#endif

static uint32_t PWR_ProgramDeepSleepTime(void);

#if (gTMR_EnableLowPowerTimers_d)
static void PWR_SyncTimers(uint32_t notCountedTicksBeforeSleep, uint32_t lptmrFreq);
#endif
#endif /* (cPWR_UsePowerDownMode) */

#if (cPWR_UsePowerDownMode)
static void PWR_AddWaitTime(uint32_t delay);
#endif


/*****************************************************************************
 *                        PUBLIC TYPE DEFINITIONS                            *
 *---------------------------------------------------------------------------*
 * Add to this section all the data types definitions: stuctures, unions,    *
 * enumerations, typedefs ...                                                *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
typedef enum
{
    PWR_Run = 77U,
    PWR_Sleep,
    PWR_DeepSleep,
    PWR_Reset,
    PWR_OFF
} PWR_CheckForAndEnterNewPowerState_t;

typedef  void (*pfHandleDeepSleepFunc_t)(void);

typedef struct _warmboot_config
{
    uint32_t doWarmbootSequence;
    uint32_t useWarmbootSp;
} warmboot_config_t;

/*****************************************************************************
 *                               PRIVATE VARIABLES                           *
 *---------------------------------------------------------------------------*
 * Add to this section all the variables and constants that have local       *
 * (file) scope.                                                             *
 * Each of this declarations shall be preceded by the 'static' keyword.      *
 * These variables / constants cannot be accessed outside this module.       *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
static uint8_t mLPMFlag = gAllowDeviceToSleep_c;
static uint64_t mLpmTotalSleepDuration;
#if (cPWR_UsePowerDownMode) && (gTMR_EnableLowPowerTimers_d)
static uint64_t mLpmLastSleepDuration;
#endif

