N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
/* store planned ADV interval time for low power mode 9*/
#if defined(PWR_Mode9AdvOnLPTimerOnly) && (PWR_Mode9AdvOnLPTimerOnly == 1)
static uint32_t mPWR_AdvdeepSleepTimeMode9Ms  = 0U;
#endif

#if (cPWR_UsePowerDownMode)
static uint8_t  mLpmXcvrDisallowCnt      = 0;

static const uint8_t pwr_app_state_to_lowpower_state[] =
{
#if (cPWR_EnableDeepSleepMode_8) || (cPWR_EnableDeepSleepMode_9)

    PWR_LOWPOWER_VLLS0_1_PSWITCH_MODE,       /* PWR_APP_STATE_NO_ACTIVITY     */
#if (cPWR_EnableDeepSleepMode_5)
    PWR_LOWPOWER_VLLS2_3_NO_DSM_MODE,        /* PWR_APP_STATE_NO_ACTIVITY_RAM_RET */
#else
    PWR_LOWPOWER_LLS2_3_NO_DSM_MODE,         /* PWR_APP_STATE_NO_ACTIVITY_RAM_RET */
#endif
#if (cPWR_EnableDeepSleepMode_9)
    PWR_LOWPOWER_VLLS2_3_LL_RESET_ADV_MODE,  /* PWR_APP_STATE_ADV   : Mode 9 only used in ADV */
#else
    PWR_LOWPOWER_VLLS2_3_LL_DSM3_MODE,       /* PWR_APP_STATE_ADV   : Use PWR_LOWPOWER_LLS2_3_LL_DSM_MODE or PWR_LOWPOWER_VLLS2_3_LL_DSM3_MODE */
#endif
    PWR_LOWPOWER_LLS2_3_LL_DSM_MODE,         /* PWR_APP_STATE_SCAN  : Use only PWR_LOWPOWER_LLS2_3_LL_DSM_MODE */
#if defined(cPWR_UseVllsInConnectedMode) && (cPWR_UseVllsInConnectedMode == 1)
    PWR_LOWPOWER_VLLS2_3_LL_DSM3_MODE,       /* PWR_APP_STATE_CONN */
#else
    PWR_LOWPOWER_LLS2_3_LL_DSM_MODE,         /* PWR_APP_STATE_CONN */
#endif

#else   // (cPWR_EnableDeepSleepMode_8) || (cPWR_EnableDeepSleepMode_9)

    PWR_LOWPOWER_VLLS0_1_PSWITCH_MODE,       /* PWR_APP_STATE_NO_ACTIVITY     */
#if (cPWR_EnableDeepSleepMode_5)
    PWR_LOWPOWER_VLLS2_3_NO_DSM_MODE,        /* PWR_APP_STATE_NO_ACTIVITY_RAM_RET */
#else
    PWR_LOWPOWER_LLS2_3_NO_DSM_MODE,         /* PWR_APP_STATE_NO_ACTIVITY_RAM_RET */
#endif
    PWR_LOWPOWER_LLS2_3_LL_DSM_MODE,         /* PWR_APP_STATE_ADV   : Use only PWR_LOWPOWER_LLS2_3_LL_DSM_MODE */
    PWR_LOWPOWER_LLS2_3_LL_DSM_MODE,         /* PWR_APP_STATE_SCAN  : Use only PWR_LOWPOWER_LLS2_3_LL_DSM_MODE */
    PWR_LOWPOWER_LLS2_3_LL_DSM_MODE,         /* PWR_APP_STATE_CONN  : Use only PWR_LOWPOWER_LLS2_3_LL_DSM_MODE */
#endif
};

#if (cPWR_GENFSK_LL_Enable)
static uint32_t mPWR_AbsoluteWakeupTimeInDsmTicks = mPWR_DSM_InvalidTime_c;
#endif
static uint8_t mLPMNoIdleIntr = 0U;
static const pfHandleDeepSleepFunc_t maHandleDeepSleep[] =
{
#if cPWR_EnableDeepSleepMode_1
    PWR_HandleDeepSleepMode_1_2_3,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_2 && cPWR_EnableDeepSleepMode_1
    PWR_HandleDeepSleepMode_1_2_3,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_3 && cPWR_EnableDeepSleepMode_1
    PWR_HandleDeepSleepMode_1_2_3,     /* Mode 3 is now handled in mode 1 handler */
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_4
    PWR_HandleDeepSleepMode_4,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if (cPWR_EnableDeepSleepMode_5)
    PWR_HandleDeepSleepMode_5_8,     /* Mode 5 is now handled in mode 8 handler */
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_6
    PWR_HandleDeepSleepMode_6,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_7
    PWR_HandleDeepSleepMode_7,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_8
    PWR_HandleDeepSleepMode_5_8,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_9
    PWR_HandleDeepSleepMode_9,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
};

static volatile AT_WARMBOOTCONFIG_SECTION(warmboot_config_t warmbootConfig);

#if (defined(gSerialManagerMaxInterfaces_c) && (gSerialManagerMaxInterfaces_c > 0))
static uint8_t  pwr_serial_interface          = PWR_SERIAL_IF_INVALID;
uint32_t        pwr_llwu_serial_bitmap        = 0U;
#endif

#endif /* (cPWR_UsePowerDownMode) */

/*****************************************************************************
 *                             PRIVATE FUNCTIONS                             *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions that have local (file) scope.       *
 * These functions cannot be accessed outside this module.                   *
 * These definitions shall be preceded by the 'static' keyword.              *
 *---------------------------------------------------------------------------*
 *****************************************************************************/

/*---------------------------------------------------------------------------
* Name: PWR_ExecuteNop
* Description: Executes NOP instruction, used mainly for Misra
*---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode)
PWR_STATIC void PWR_ExecuteNop(void)
{
    /* Putting ASM instruction in a static function to isolate the code
       and fix related MISRA issue */
    asm volatile("NOP");
}
#endif /* cPWR_UsePowerDownMode */

/*---------------------------------------------------------------------------
 * Name: PWR_GenfskGetDsmDurationMs
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable))
#if defined(__IAR_SYSTEMS_ICC__)
__weak uint32_t PWR_GenfskGetDsmDurationMs(void)
#elif defined(__GNUC__)
__attribute__((weak)) uint32_t PWR_GenfskGetDsmDurationMs(void)
#endif
{
     return mPWR_DeepSleepTimeMs >> 3;
}
#endif /* ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable)) */

/*---------------------------------------------------------------------------
 * Name: PWR_GENFSK_EnterDSM
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/

bool_t PWR_GENFSK_EnterDSM(uint32_t dsmDuration)
{
#if ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable))
    uint32_t dsmOscOffset;
    uint64_t durationInDsmTicks;

    /* Compute the duration in 32.768KHz ticks. */
    durationInDsmTicks = (dsmDuration << 15)/1000;

    if(durationInDsmTicks > mPWR_DSM_TimerMask_c)
    {
        durationInDsmTicks = mPWR_DSM_TimerMask_c;
    }

