N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
    dsmOscOffset = 1024 << READ_REGISTER_FIELD(RSIM->RF_OSC_CTRL,RSIM_RF_OSC_CTRL_BB_XTAL_READY_COUNT_SEL);
    dsmOscOffset = (dsmOscOffset << 15)/BOARD_BOOTCLOCKRUN_CORE_CLOCK;

    if(durationInDsmTicks > dsmOscOffset)
    {
        uint32_t dsmSleep;

        RSIM->DSM_OSC_OFFSET = dsmOscOffset;  /* Set the DSM oscillator offset. */
        dsmSleep = (RSIM->DSM_TIMER + 5) & mPWR_DSM_TimerMask_c;  /* Compute the sleep time. No fewer than 4 clocks greater than DSM_TIMER. */
        RSIM->GEN_SLEEP = dsmSleep;
        mPWR_AbsoluteWakeupTimeInDsmTicks = (dsmSleep + durationInDsmTicks) & mPWR_DSM_TimerMask_c;  /* Compute wake-up time. */
        RSIM->GEN_WAKE = mPWR_AbsoluteWakeupTimeInDsmTicks;
        GENFSK->DSM_CTRL = GENFSK_DSM_CTRL_GEN_SLEEP_REQUEST_MASK;  /* Enter DSM */
    }
    else
    {
        mPWR_AbsoluteWakeupTimeInDsmTicks = mPWR_DSM_InvalidTime_c;

        return FALSE;
    }

    return TRUE;
#else
    return FALSE;
#endif /* ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable)) */
}

/*---------------------------------------------------------------------------
 * Name: PWR_HandleGenfskDsmEnter
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable) && (cPWR_EnableDeepSleepMode_7))
static bool_t PWR_HandleGenfskDsmEnter(void)
{
    uint32_t currentDsmTime;
    uint32_t dsmOscOffset;
    uint32_t durationInDsmTicks = 0;
    bool_t retVal = FALSE;

    currentDsmTime = RSIM->DSM_TIMER;  /* Get the current DSM time. */

    /* Compute the remaining sleep period. */
    if (mPWR_AbsoluteWakeupTimeInDsmTicks != mPWR_DSM_InvalidTime_c)
    {
        if (currentDsmTime < mPWR_AbsoluteWakeupTimeInDsmTicks)
        {
            durationInDsmTicks = mPWR_AbsoluteWakeupTimeInDsmTicks - currentDsmTime;
        }
        else
        {
            durationInDsmTicks = mPWR_DSM_MaxTimeCount_c - currentDsmTime + mPWR_AbsoluteWakeupTimeInDsmTicks;
        }
    }

    dsmOscOffset = 1024 << READ_REGISTER_FIELD(RSIM->RF_OSC_CTRL,RSIM_RF_OSC_CTRL_BB_XTAL_READY_COUNT_SEL);
    dsmOscOffset = (dsmOscOffset << 15)/BOARD_BOOTCLOCKRUN_CORE_CLOCK;

    if(durationInDsmTicks > dsmOscOffset)
    {
        uint32_t dsmSleep;

        RSIM->DSM_OSC_OFFSET = dsmOscOffset;
        dsmSleep = (RSIM->DSM_TIMER + 5) & mPWR_DSM_TimerMask_c;
        RSIM->GEN_SLEEP = dsmSleep;
        RSIM->GEN_WAKE = mPWR_AbsoluteWakeupTimeInDsmTicks;
        GENFSK->DSM_CTRL = GENFSK_DSM_CTRL_GEN_SLEEP_REQUEST_MASK;
        retVal = TRUE;
    }

    return retVal;
}
#endif /* ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable)) */

/*---------------------------------------------------------------------------
 * Name: PWR_HandleGenfskDsmExit
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable) && (cPWR_EnableDeepSleepMode_7))
static void PWR_HandleGenfskDsmExit(void)
{
    if(READ_REGISTER_FIELD(RSIM->DSM_CONTROL,RSIM_DSM_CONTROL_GEN_SLEEP_REQUEST))
    {
        uint32_t remainTicksToSleep;
        uint32_t dsmTimer = RSIM->DSM_TIMER;

        remainTicksToSleep = RSIM->GEN_WAKE;
        remainTicksToSleep = (remainTicksToSleep - dsmTimer) & mPWR_DSM_TimerMask_c;

        if(remainTicksToSleep > 5)
        {
            RSIM->GEN_WAKE = (dsmTimer + 5) & mPWR_DSM_TimerMask_c;
        }
    }
}
#endif /* ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable)) */

/*---------------------------------------------------------------------------
 * Name: PWR_ProcessWakeupReason
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode)
static void PWR_ProcessWakeupReason(void)
{
#if defined(gSerialManagerMaxInterfaces_c) && (gSerialManagerMaxInterfaces_c > 0)
    if(PWRLib_MCU_WakeupReason.Bits.FromSerial != 0U)
    {
        assert( pwr_serial_interface != PWR_SERIAL_IF_INVALID );

        SerialInterface_SerialIsWakeupSrc( pwr_serial_interface );
        PWRLib_MCU_WakeupReason.Bits.FromSerial = 0U;
    }
#endif

#if (gKBD_KeysCount_c > 0)
    /* Woke up on Keyboard Press */
    if(PWRLib_MCU_WakeupReason.Bits.FromKeyBoard != 0U)
    {
#if defined(cPWR_BleAppHandleKeyDirectCall_d) && ( cPWR_BleAppHandleKeyDirectCall_d == 1)
        /* Skip over the key scan timer to improve low power consumption. */
        /* Warning : we assume that the pin wakeup is PB2 */
extern void BleApp_HandleKeys(key_event_t events);
        BleApp_HandleKeys(gKBD_EventPressPB2_c);
#else
        KBD_SwitchPressedOnWakeUp();
#endif
        PWRLib_MCU_WakeupReason.Bits.FromKeyBoard = 0U;
    }
#endif
}

/*---------------------------------------------------------------------------
 * Name: PWR_WaitFor32MhzReady
 *---------------------------------------------------------------------------*/
static void PWR_WaitFor32MhzReady(void)
{
    uint32_t count_down = cPWR_RfReadyBitTimeout;

    BOARD_DBGLPIOSET(1,0);
    while( (RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_READY) == 0U) && (count_down!=0u) )
    {
        BOARD_DBGLPIOSET(1,1);
        PWR_NOP;
        BOARD_DBGLPIOSET(1,0);
        count_down--;
    }
    BOARD_DBGLPIOSET(1,1);

    /* got the exit from timeout, something went wrong on the XTAL32M oscillator , disable it and reset */
    if ( count_down == 0u )
    {
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_EN, 0u);
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0u);

        /* wait some time for Oscillator to switch off */
        PWR_AddWaitTime(cPWR_WaitRFOscillatorSwitchOff);

        /* turn back the oscillator ON, it should recover now */
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_EN, 1u);
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 1u);

        /* wait for READY bit to be set again */
        count_down = cPWR_RfReadyBitTimeout;
        BOARD_DBGLPIOSET(1,0);
        while( (RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_READY) == 0U) && (count_down!=0u) )
        {
            BOARD_DBGLPIOSET(1,1);
            PWR_NOP;
            BOARD_DBGLPIOSET(1,0);
            count_down--;
        }
        BOARD_DBGLPIOSET(1,1);

        /* timeout occurs again,  turn the XTAl Off again and reset the device */
        if ( count_down == 0u )
        {
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_EN, 0u);
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0u);

            /* wait some time for Oscillator to switch off */
            PWR_AddWaitTime(cPWR_WaitRFOscillatorSwitchOff);

            NVIC_SystemReset();
        }
    }
}
#endif

#if (cPWR_UsePowerDownMode)
/*---------------------------------------------------------------------------
 * Name: PWR_AddWaitTime
 * Description: - Generic Lowpower function to add a specif waiting time
 * Parameters:  - delay - The value of delay depends on the clock configuration.
 * Return: -
 *---------------------------------------------------------------------------*/
static void PWR_AddWaitTime(uint32_t delay)
{
    for (uint32_t i= delay; i>0U; i--)
    {
        PWR_NOP;
    }
}
#endif

