N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
#if defined(PWR_Mode9AdvOnLPTimerOnly) && (PWR_Mode9AdvOnLPTimerOnly == 1)
/*---------------------------------------------------------------------------
* Name: PWR_GetLastSleepDurationMS
* Description: -
* Parameters: -
* Return: -
*---------------------------------------------------------------------------*/
static uint32_t PWR_GetLastSleepDurationMS(void)
{
    uint32_t time;

    time = (uint32_t) (mLpmLastSleepDuration / 1000ULL);

    return time;
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode
 * Description: - Generic Lowpower handler to LLS disregarding the GenFSK or Link layer state
 *      The function will overide the stop acknowledge from the radio
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_HandleDeepSleepMode(void)
{
#if (cPWR_UsePowerDownMode)
#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep = 0U;
#endif /* (gTMR_EnableLowPowerTimers_d) */

    uint32_t lptmrFreq;

    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGLPIOSET(2,1);

    PWR_DBG_LOG("");

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
    /* Disable SysTick counter and interrupt */
    uint32_t sysTickCtrl = SysTick->CTRL & (SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
    SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
#endif

    lptmrFreq = PWR_ProgramDeepSleepTime();

#if (gTMR_EnableLowPowerTimers_d)
    /* If more low power timers are running, stop the hardware timer
    * and save the spend time in ticks that wasn't counted.    */
    notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif /* (gTMR_EnableLowPowerTimers_d) */

    PWR_DBG_LOG("");
    DBG_LOG_DUMP(FALSE);

    BOARD_DBGLPIOSET(0,0);
    BOARD_EnterLowPowerCb();
    BOARD_DBGLPIOSET(0,1);

     /* set LLWU wakeup sources in addition to IO wakeup sources (set during Init) */
    LLWU->ME = gPWRLib_LLWU_WakeupModuleEnable_LPTMR_c;

    /* set RSIM for low power mode : Disregard the stop acknowledge from the radio */
    RSIM->CONTROL &= ~(RSIM_CONTROL_RF_OSC_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK);
    RSIM->CONTROL |= RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK | RSIM_CONTROL_RSIM_STOP_ACK_OVRD_MASK | \
                     RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK;

    PWRLib_MCU_Enter_LLSx();

    /* reenable 32Mhz oscillator */
    RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 1U);

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1) && \
    defined(gPWR_UsePswitchMode_d) && (gPWR_UsePswitchMode_d == 1)
    /* If RAM is saved in Flash, then PWR_HandleDeepSleepMode is used to LLS
        until 32KHz is ready for proper DCDC shutdown  */
    if ( gPWRLib_RamSavedStatus == PWRLIB_RAM_SAVED )
    {
        DCDC_ShutDown();
    }
#endif

    BOARD_DBGLPIOSET(0,0);
    BOARD_ExitLowPowerCb();
    BOARD_DBGLPIOSET(0,1);

    /* Clear potential wakeup reasons but do not call PWRLib_LLWU_UpdateWakeupReason() , the event will be taken from the interrupt,
        not from the PWRLib_MCU_WakeupReason variable                   */
    PWRLib_LLWU_ClearWakeUpSources();
    PWRLib_LPTMR_ClockStop();

    /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
    PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#else
    NOT_USED(lptmrFreq);
#endif /* (gTMR_EnableLowPowerTimers_d) */

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
    SysTick->CTRL |= sysTickCtrl;
#endif

    /* Make sure 32MHz osc is ready before going further.
       The oscillator could be needed right after then */
    PWR_WaitFor32MhzReady();

    BOARD_DBGLPIOSET(0,0);
    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGLPIOSET(2,1);

#endif   /* #if (cPWR_UsePowerDownMode) */
    return;
}


/*---------------------------------------------------------------------------
 * Name: && PWR_HandleDeepSleepMode_1_2_3
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_1)
static void PWR_HandleDeepSleepMode_1_2_3(void)
{
#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep = 0U;
    uint32_t lptmrFreq;
#endif /* (gTMR_EnableLowPowerTimers_d) */

#if cPWR_BLE_LL_Enable
    bool_t   enterLowPower;
    bool_t   isLinkLayerAwake   = FALSE;
    uint32_t wakeup_offset      = cPWR_BLE_LL_OffsetToWakeupInstant;
    uint32_t osc_startup_delay  = cPWR_BLE_LL_OscStartupDelayLls;
    uint16_t nextInstant        = PWR_NEXT_INSTANT_INVALID;
    uint16_t offsetBeforeDsmExit;
#endif

    BOARD_DBGLPIOSET(2,0);

#ifdef BOARD_DBG_ENABLE
    static int count = DUMP_EVERY_X_TIMES;
    if (--count==0)
    {
        DBG_LOG_DUMP(FALSE);
        count = DUMP_EVERY_X_TIMES;
    }
#endif

    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);

#if cPWR_BLE_LL_Enable
    offsetBeforeDsmExit = OFFSET_BEFORE_DSM_EXIT( wakeup_offset, osc_startup_delay);

    enterLowPower = PWR_CheckBLE_LL_state(&nextInstant, &isLinkLayerAwake, offsetBeforeDsmExit);
    if(enterLowPower)
#endif
    {
        uint32_t        rfOscEn, rsimCtrl;
        bool_t          abort           = FALSE;   // Set to False in case cPWR_BLE_LL_Enable not set

#if cPWR_BLE_LL_Enable
        uint16_t        clk_cfg         = BLE_LL_CLOCK_CONFIG_LP_MOD_1;

        PWR_DBG_LOG("[%d] %d", mPWRLib_DeepSleepMode, nextInstant);

        /* For now isLinkLayerAwake shall always be set */
        assert(isLinkLayerAwake);

#if defined(cPWR_UseDefaultClockInLLS) && (cPWR_UseDefaultClockInLLS == 1)
        /* Restore default Core Clock
           Active consumption is reduced but active time is increased, leading
           to no gain in overall power consumption */
        BOARD_ResetCoreClock();
#endif

        /* Optimization */
        if(PWRLib_AppState == PWR_APP_STATE_ADV)
        {
            /* shorten a bit the Osc startup time - the Timebase does not need to be so accurate in ADV */
            osc_startup_delay = cPWR_BLE_LL_OscStartupDelayLlsAdv;
        }

