N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
        /* set DSM configuration */
        BLE_LL_REG(WAKEUP_CONFIG) = ( WAKEUP_CFG_OSC_STARTUP_DELAY(wakeup_offset, osc_startup_delay) |
                                    BLE_LL_WAKEUP_CONFIG_CON_RAM_DSM_RET);

        if ( (mPWRLib_DeepSleepMode == PWR_LOWPOWER_LLS2_3_NO_DSM_MODE) )
        {
            clk_cfg = BLE_LL_CLOCK_CONFIG_LP_MOD_2_3;
            DBG_LOG_DUMP(FALSE);
        }
        BLE_LL_REG(CLOCK_CONFIG)  = clk_cfg;

        /* Set next instant */
        PWRLib_BLL_SetWakeupInstant(nextInstant);

        /* Time for LL to enter DSM now since all LL registers have been set up */
        abort = PWRLib_BLL_EnterDSM();

#else
        PWR_DBG_LOG("[%d]", mPWRLib_DeepSleepMode);
#endif

        if (abort == FALSE)
        {
            bool lowpower_skipped;

            /* go on lowpower entry sequence */
            BOARD_EnterLowPowerCb();

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
            /* Disable SysTick counter and interrupt */
            uint32_t sysTickCtrl = SysTick->CTRL & (SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
            SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
#endif

#if (gTMR_EnableLowPowerTimers_d)
            lptmrFreq = PWR_ProgramDeepSleepTime();
            /* If more low power timers are running, stop the hardware timer
            * and save the spend time in ticks that wasn't counted.
            */
            notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif /* (gTMR_EnableLowPowerTimers_d) */

            /* set LLWU wakeup sources in addition to IO wakeup sources (set during Init) */
            LLWU->ME = gPWRLib_LLWU_WakeupModuleEnable_Radio_c | gPWRLib_LLWU_WakeupModuleEnable_LPTMR_c;

            /* set RSIM for low power mode */
            rsimCtrl = RSIM->CONTROL;
            rfOscEn =  (rsimCtrl & RSIM_CONTROL_RF_OSC_EN_MASK) >> RSIM_CONTROL_RF_OSC_EN_SHIFT;
            rsimCtrl &= ~(RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK | RSIM_CONTROL_RF_OSC_EN_MASK);
            RSIM->CONTROL = rsimCtrl | RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK;

            lowpower_skipped = PWRLib_MCU_Enter_lls1_2_3();

#if cPWR_BLE_LL_Enable
            if ( lowpower_skipped == TRUE )
            {
                /* lowpower has been aborted, wait for Link layer to be in DSM first */
                BOARD_DBGLPIOSET(0,0);
                BOARD_DBGLPIOSET(0,1);
                BOARD_DBGLPIOSET(0,0);

                /*   Add time delay before turning ON the oscillator because we don t know
                when it was turned off previously (could happen immediatly after going to lowpower) */
                PWR_AddWaitTime(cPWR_WaitLlDelayOnLateIrq);
                BOARD_DBGLPIOSET(0,1);
            }

            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);

            /* check if BLE LL exits DSM - Otherwise , force a wakeup now, this will take a while */
            if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_INT) == 0U)
            {
                /* This is safe to do a SW request to Link layer layer */
                PWR_DBG_LOG("SW request");
                BOARD_DBGLPIOSET(5,0);
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT, 1U);
                BOARD_DBGLPIOSET(5,1);
            }

#else   // cPWR_BLE_LL_Enable
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);
            (void)lowpower_skipped;
#endif

            BOARD_DBGLPIOSET(3,0);
            BOARD_ExitLowPowerCb();
            BOARD_DBGLPIOSET(3,1);

            PWRLib_LLWU_UpdateWakeupReason();

            /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
            PWRLib_LPTMR_ClockStop();
            PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif /* (gTMR_EnableLowPowerTimers_d) */

            PWR_WaitFor32MhzReady();

            PWRLib_BLPItoBPE();

#if cPWR_BLE_LL_Enable
            BOARD_DBGLPIOSET(4,0);
            BOARD_DBGLPIOSET(0,0);
            PWRLib_BLL_WaitForDSMExit();
            BOARD_DBGLPIOSET(0,1);

            PWRLib_ClearRSIMInt();

            /* reset DSM_EXIT flag */
            //RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT, 0U);

            /* Reset LL DSM timer */
            RSIM->DSM_CONTROL |= RSIM_DSM_CONTROL_DSM_TIMER_CLR_MASK;
            BOARD_DBGLPIOSET(4,1);
#endif

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
            SysTick->CTRL |= sysTickCtrl;
#endif

            PWR_ProcessWakeupReason();

            /* can be used to measure vbat at wake up */
            DCDC_ExitLowPowerPostCb();

            PWRLib_BPEtoBLPE();
        }
    }

    BOARD_DBGLPIOSET(0,0);
    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGLPIOSET(2,1);

}
#endif /* (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_1) */

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_4
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_4)
static void PWR_HandleDeepSleepMode_4(void)
{
    BOARD_DBGLPIOSET(4,0);
    BOARD_DBGLPIOSET(4,1);
    BOARD_DBGLPIOSET(4,0);
#if defined(gAppUseNvm_d) && (gAppUseNvm_d==1)
    /* Make sure NVM module has completed all pending operations before
           shutting down the RAM
        Use the Unsafe function as Interrupt already masked (requires with RTOS
            in tickless mode) */
    NvCompletePendingOperationsUnsafe();
#endif

#if defined(gPWR_UsePswitchMode_d) && (gPWR_UsePswitchMode_d == 1)
    PWR_DBG_LOG("");
    DBG_LOG_DUMP(FALSE);

    /* Switch OFF DCDC immediatly */
    DCDC_ShutDown();
#else
    uint8_t  mode;

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
    uint16_t bleEnabledInt;
#endif

    PWR_DBG_LOG("");
    DBG_LOG_DUMP(FALSE);

