N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
    BOARD_EnterLowPowerCb();

#if (gTMR_EnableLowPowerTimers_d)

    if(gTmrInvalidSleepTime == TMR_GetFirstExpireTime(gTmrLowPowerTimer_c))
    {
        /* If no LPTMR are running we can disable 32k osc to save power */
        LPTMR_Deinit(LPTMR0);
        BOARD_RTC_Deinit();
    }
    else
    {
        /* if a lowpower timer is active, the device will wake up from RAMOFF after first timer expiration */
        (void)PWR_ProgramDeepSleepTime();
    }
#else
    /* If LPTMR are not enabled, we can always shutdown the 32khz osc */
    BOARD_RTC_Deinit();
#endif /* (gTMR_EnableLowPowerTimers_d) */

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
    bleEnabledInt = PWRLib_BLL_GetIntEn();
    PWRLib_BLL_ClearInterrupts(bleEnabledInt);
    PWRLib_BLL_DisableInterrupts(bleEnabledInt);
#endif

    /* set LLWU wakeup sources */
    LLWU->ME = (gPWRLib_LLWU_WakeupModuleEnable_DCDC_c  | gPWRLib_LLWU_WakeupModuleEnable_LPTMR_c);

    /* set RSIM for low power mode */
    RSIM->CONTROL &= ~( RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK |
                       RSIM_CONTROL_RF_OSC_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK);
    RSIM->CONTROL |= RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK | RSIM_CONTROL_RSIM_STOP_ACK_OVRD_MASK;

#if (APP_DCDC_MODE == gDCDC_Bypass_c)
    mode = PWRLIB_VLLS_0;
#else
    mode = PWRLIB_VLLS_1;
#endif

    BOARD_DBGLPIOSET(4,1);

    PWRLib_MCU_Enter_VLLSx(mode);

    BOARD_DBGLPIOSET(4,0);

    /* reenable 32Mhz oscillator */
    RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 1U);

    /* Restart lowpower timers and RTC if disabled during lowpower entry */
    BOARD_RTC_Init();
    PWRLib_LPTMR_Init();

    BOARD_DBGLPIOSET(3,0);
    BOARD_ExitLowPowerCb();
    BOARD_DBGLPIOSET(3,1);

    PWR_WaitFor32MhzReady();

    PWR_DBG_LOG("Early Wakeup due to late IT: %d", mode);

    /* Clear wakeup sources if any , event will be taken by IRQ */
    PWRLib_LLWU_ClearWakeUpSources();

    DBG_LOG_DUMP(FALSE);

    BOARD_DBGLPIOSET(4,1);
    BOARD_DBGLPIOSET(4,0);
    BOARD_DBGLPIOSET(4,1);
#endif
}
#endif


/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_6
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_6)
static void PWR_HandleDeepSleepMode_6(void)
{
    uint32_t rfOscEn, rsimCtrl;
#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1) && (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep = 0U;
    uint32_t lptmrFreq;
#endif /* (gTMR_EnableLowPowerTimers_d) */
    /* prevent stop mode if next LL activity has no idle interrupt */
    if (mLPMNoIdleIntr == 0U)
    {
        BOARD_DBGLPIOSET(3,0);

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
        PWRLib_BLL_EnableInterrupts(BLE_LL_EVENT_ENABLE_LLH_IDLE_INT_MASK);
#endif

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
        BLE_LL_REG(CLOCK_CONFIG) = BLE_LL_CLOCK_CONFIG_LP_MOD_6;
#endif

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
        /* Disable SysTick counter and interrupt */
        uint32_t sysTickCtrl = SysTick->CTRL & (SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
        SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);

        /* In stop mode, Lowpower timers are only required when PWR_EnableRtosSysticks is set
              in order to count the time spent in stop mode and compensate the tick counts on wakeup   */
#if (gTMR_EnableLowPowerTimers_d)
        lptmrFreq = PWR_ProgramDeepSleepTime();
        /* If more low power timers are running, stop the hardware timer
        * and save the spend time in ticks that wasn't counted.    */
        notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif /* (gTMR_EnableLowPowerTimers_d) */
#endif

        /* set LLWU wakeup sources */
        LLWU->ME = 0;

        /* set RSIM for low power mode */
        rsimCtrl = RSIM->CONTROL;
        rfOscEn =  (rsimCtrl & RSIM_CONTROL_RF_OSC_EN_MASK) >> RSIM_CONTROL_RF_OSC_EN_SHIFT;
        rsimCtrl = (((RSIM->CONTROL) & (~(RSIM_CONTROL_RF_OSC_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK))) | RSIM_CONTROL_RF_OSC_EN(0x3));
        RSIM->CONTROL = rsimCtrl | RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK | RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK | RSIM_CONTROL_RSIM_STOP_ACK_OVRD_MASK;

        SIM->FCFG1 |= SIM_FCFG1_FLASHDOZE_MASK;

        BOARD_DBGLPIOSET(3,1);
        PWRLib_MCU_Enter_Stop();
        BOARD_DBGLPIOSET(3,0);

        SIM->FCFG1 &= ~SIM_FCFG1_FLASHDOZE_MASK;
        RSIM->CONTROL &= ~RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK;

        PWR_WaitFor32MhzReady();

        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
        /* check if STOP mode exit was on LL interrupt */
        if( (BLE_LL_REG_EVENT_STATUS & BLE_LL_EVENT_ENABLE_LLH_IDLE_INT_MASK) != 0U )
        {
            PWRLib_BLL_ClearInterrupts(BLE_LL_EVENT_ENABLE_LLH_IDLE_INT_MASK);
        }
#endif

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
        /* Restore the state of SysTick */
        SysTick->CTRL |= sysTickCtrl;

        /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
        PWRLib_LPTMR_ClockStop();
        PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif /* (gTMR_EnableLowPowerTimers_d) */
#endif

#if cPWR_BLE_LL_Enable
        PWRLib_BLL_DisableInterrupts(BLE_LL_EVENT_ENABLE_LLH_IDLE_INT_MASK);
#endif

        BOARD_DBGLPIOSET(3,1);
    }
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_7
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_7)
static void PWR_HandleDeepSleepMode_7(void)
{
#if (cPWR_GENFSK_LL_Enable)
#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep= 0;
#endif
    uint32_t lptmrFreq;
    bool_t enterLowPower = TRUE;

