N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
    BOARD_DBGLPIOSET(4,0);

#ifdef BOARD_DBG_ENABLE
    static int count = DUMP_EVERY_X_TIMES;
    if (--count==0)
    {
        DBG_LOG_DUMP(FALSE);
        count = DUMP_EVERY_X_TIMES;
    }
#endif

    BOARD_DBGLPIOSET(4,1);
    BOARD_DBGLPIOSET(4,0);

    lptmrFreq = PWR_ProgramDeepSleepTime();

#if (gTMR_EnableLowPowerTimers_d)
    /* If more low power timers are running, stop the hardware timer
     * and save the spend time in ticks that wasn't counted.
     */
    notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif

    if(enterLowPower && (READ_REGISTER_FIELD(RSIM->DSM_CONTROL,RSIM_DSM_CONTROL_GEN_SLEEP_REQUEST) == 0U))
    {
        enterLowPower &= PWR_HandleGenfskDsmEnter();
    }

    PWR_DBG_LOG("%d", enterLowPower);

    if(enterLowPower)
    {
        uint32_t rfOscEn, rsimCtrl;

        /* set DSM configuration */
        BLE_LL_REG(WAKEUP_CONFIG) = (((cPWR_BLE_LL_OffsetToWakeupInstant << BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_SHIFT) & BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_MASK) |
                                    ((cPWR_BLE_LL_OscStartupDelayLls << BLE_LL_WAKEUP_CONFIG_OSC_DELAY_SHIFT)& BLE_LL_WAKEUP_CONFIG_OSC_DELAY_MASK) |
                                    BLE_LL_WAKEUP_CONFIG_CON_RAM_DSM_RET);
        BLE_LL_REG(CLOCK_CONFIG) = BLE_LL_CLOCK_CONFIG_LP_MOD_7;

        BOARD_EnterLowPowerCb();

        /* set LLWU wakeup sources */
        LLWU->ME = gPWRLib_LLWU_WakeupModuleEnable_Radio_c | gPWRLib_LLWU_WakeupModuleEnable_LPTMR_c;

        /* set RSIM for low power mode */
        rsimCtrl = RSIM->CONTROL;
        rfOscEn =  (rsimCtrl & RSIM_CONTROL_RF_OSC_EN_MASK) >> RSIM_CONTROL_RF_OSC_EN_SHIFT;
        rsimCtrl &= ~(RSIM_CONTROL_RF_OSC_EN_MASK | RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK);
        RSIM->CONTROL = rsimCtrl | RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK ;

        PWRLib_MCU_Enter_LLSx();

        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);

        PWR_WaitFor32MhzReady();

        BOARD_ExitLowPowerCb();

        PWRLib_LLWU_UpdateWakeupReason();

        PWR_HandleGenfskDsmExit();

        PWR_ProcessWakeupReason();
    }

    PWRLib_LPTMR_ClockStop();

    /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
    PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif

    BOARD_DBGLPIOSET(4,1);

#else
    PWRLib_MCU_WakeupReason.AllBits = 0;
#endif
}
#endif


/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_5_8
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && (cPWR_EnableDeepSleepMode_8 || cPWR_EnableDeepSleepMode_5))
static void PWR_HandleDeepSleepMode_5_8(void)
{
#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep = 0U;
    uint32_t lptmrFreq;
#endif /* (gTMR_EnableLowPowerTimers_d) */

    bool_t   enterLowPower;
    bool_t   isLinkLayerAwake   = FALSE;
    uint16_t wakeup_offset      = cPWR_BLE_LL_OffsetToWakeupInstant + 1U;   /* wakeup 1 slot in advance to restore LLH */
    uint16_t osc_startup_delay  = cPWR_BLE_LL_OscStartupDelayVlls;
    uint16_t nextInstant        = PWR_NEXT_INSTANT_INVALID;
    uint16_t offsetBeforeDsmExit;

    BOARD_DBGLPIOSET(2,0);

    offsetBeforeDsmExit = OFFSET_BEFORE_DSM_EXIT( wakeup_offset, osc_startup_delay);

#ifdef BOARD_DBG_ENABLE
    static int count = DUMP_EVERY_X_TIMES;
    if (--count==0)
    {
        DBG_LOG_DUMP(FALSE);
        count = DUMP_EVERY_X_TIMES;
    }
#endif

    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);

    /* Clear LLWU events right now so we can catch new events later on after interrupts are discarded */
    PWRLib_LLWU_ClearWakeUpSources();

    enterLowPower = PWR_CheckBLE_LL_state(&nextInstant, &isLinkLayerAwake, offsetBeforeDsmExit);

    if(enterLowPower)
    {
        uint32_t rsimCtrl;
        bool     lowpower_skipped;
        bool_t   abort;
        uint16_t clk_cfg = BLE_LL_CLOCK_CONFIG_LP_MOD_8;

        /* For now, isLinkLayerAwake shall always be set */
        assert(isLinkLayerAwake);

        //PWR_DBG_LOG("[%d] %d", mPWRLib_DeepSleepMode, nextInstant);

        /* Optimization */
        if(PWRLib_AppState == PWR_APP_STATE_ADV)
        {
            /* shorten a bit the Osc startup time - the Timebase does not need to be so accurate in ADV */
            osc_startup_delay = cPWR_BLE_LL_OscStartupDelayVllsAdv;
        }

        /* set DSM configuration */
        BLE_LL_REG(WAKEUP_CONFIG) = ( WAKEUP_CFG_OSC_STARTUP_DELAY(wakeup_offset, osc_startup_delay) |
                                        BLE_LL_WAKEUP_CONFIG_CON_RAM_DSM_RET);

        if (mPWRLib_DeepSleepMode == PWR_LOWPOWER_VLLS2_3_NO_DSM_MODE)
        {
            clk_cfg = BLE_LL_CLOCK_CONFIG_LP_MOD_5;
            DBG_LOG_DUMP(FALSE);
        }
        BLE_LL_REG(CLOCK_CONFIG)  = clk_cfg;

        /* Set next instant */
        PWRLib_BLL_SetWakeupInstant(nextInstant);

        /* Time for LL to enter DSM now since all LL registers have been set up */
        abort = PWRLib_BLL_EnterDSM();

        if (abort == FALSE)
        {
            BOARD_EnterLowPowerCb();

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
            /* Disable SysTick counter and interrupt */
            uint32_t sysTickCtrl = SysTick->CTRL & ( SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
            SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
#endif

#if (gTMR_EnableLowPowerTimers_d)
            lptmrFreq = PWR_ProgramDeepSleepTime();

            /* If more low power timers are running, stop the hardware timer
            * and save the spend time in ticks that wasn't counted.        */
            notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif /* (gTMR_EnableLowPowerTimers_d) */

            /* set LLWU wakeup sources */
            LLWU->ME = gPWRLib_LLWU_WakeupModuleEnable_Radio_c | gPWRLib_LLWU_WakeupModuleEnable_LPTMR_c;

            /* set RSIM for low power mode */
            rsimCtrl = RSIM->CONTROL;
            rsimCtrl &= ~( RSIM_CONTROL_RF_OSC_EN_MASK | RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK);
            RSIM->CONTROL = rsimCtrl | RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK ;

            lowpower_skipped = PWRLib_MCU_Enter_vlls2_3();

            /* Reenable 32Mhz oscillator
              usually done in SystemInitHookWarm(), However, if the WFI has been skipped (no lowpower entry)
              It is mandatory to enable it again here for Radio ReInit and linkLayer wakeup */
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 1U);

            BOARD_SetCoreClock48Mhz();

