N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
            BOARD_DBGLPIOSET(3,0);
            PWRLib_LLWU_UpdateWakeupReason();

            /* No need to reinitialize the peripherals if the lowpower has been skipped */
            if ( lowpower_skipped == FALSE )
            {
                BOARD_ExitLowPowerVllsCb();
            }
            else
            {
                /* give some time for LL to be fully in DSM mode, otherwise, it will ignore the SW wakeup request */
                PWR_AddWaitTime(cPWR_WaitLlDelayOnLateIrq);
            }

            BOARD_ExitLowPowerCb();
            BOARD_DBGLPIOSET(3,1);

            BOARD_DBGLPIOSET(3,0);
#if (gTMR_Enabled_d)
            /* Initialize the timer */
            TMR_ExitLowPower();
#endif

#if (gTMR_EnableLowPowerTimers_d)
            PWRLib_LPTMR_ClockStop();

            /* Sync. the low power timers - this makes the Timer task in ready state*/
            PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif /* (gTMR_EnableLowPowerTimers_d) */
            BOARD_DBGLPIOSET(3,1);

            BOARD_DBGLPIOSET(3,0);
            /* can be used to measure vbat at wake up */
            DCDC_ExitLowPowerPostCb();
            BOARD_DBGLPIOSET(3,1);

            /* Check if BLE LL exits DSM - Otherwise , force a wakeup now, this will take a while
               Warning : In case the device did not get to VLLS  (WFI skipped due to late interrupt)
                   wakeup of Link layer shall be requested after 32Mhz clock is ready */
            if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_INT) == 0U)
            {
                /* Radio will wait for 32Mhz during reinit so this can be done only
                     before SW request LL to wakeup */
                PWR_WaitFor32MhzReady();

                BOARD_DBGLPIOSET(5,0);
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT, 1U);
                BOARD_DBGLPIOSET(5,1);
            }

            /* Init RF */
            BOARD_DBGLPIOSET(5,0);
            Controller_RadioInit();
            BOARD_DBGLPIOSET(5,1);

            BOARD_DBGLPIOSET(4,0);
            PWRLib_BLL_WaitForDSMExit();
            BOARD_DBGLPIOSET(4,1);

            /* Restore BLE LL context */
            BOARD_DBGLPIOSET(4,0);
            Controller_RestoreLlhState();
            Controller_RestoreLlhStateComplete();

            PWRLib_ClearRSIMInt();

            /* Reset LL DSM timer */
            RSIM->DSM_CONTROL |= RSIM_DSM_CONTROL_DSM_TIMER_CLR_MASK;;

            /* reset DSM_EXIT flag - DSM exit interrupt is non interruptable */
            //RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT, 0);
            BOARD_DBGLPIOSET(4,1);

            PWRLib_BLPItoBPE();

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
            SysTick->CTRL |= sysTickCtrl;
#endif

            if ( lowpower_skipped == FALSE )
            {
                BOARD_DBGLPIOSET(3,0);
                BOARD_ExitLowPowerVllsPostCb();
                BOARD_DBGLPIOSET(3,1);

                PWR_ProcessWakeupReason();
            }
            else
            {
                 /* In case of early wakeup due to late interrupt, event will be handled directly from the ISR */
                 PWRLib_MCU_WakeupReason.AllBits = 0;
            }

            PWRLib_BPEtoBLPE();
        }
    }

    BOARD_DBGLPIOSET(0,0);
    BOARD_DBGLPIOSET(2,1);
#else
    PWRLib_MCU_WakeupReason.AllBits = 0;
#endif /* cPWR_BLE_LL_Enable */
}
#endif /* (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_8) */

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_9
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_9)
static void PWR_HandleDeepSleepMode_9(void)
{
#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep = 0U;
    uint32_t lptmrFreq;
#endif /* (gTMR_EnableLowPowerTimers_d) */

    bool_t   enterLowPower;
    bool_t   isLinkLayerAwake   = FALSE;
    uint16_t wakeup_offset      = cPWR_BLE_LL_OffsetToWakeupInstant + 1U;   /* wakeup 1 slot in advance to restore LLH */
    uint16_t osc_startup_delay  = cPWR_BLE_LL_OscStartupDelayVlls;
    uint16_t nextInstant        = PWR_NEXT_INSTANT_INVALID;
    uint16_t offsetBeforeDsmExit;

    BOARD_DBGLPIOSET(2,0);

    /* mode 9 can only be used in ADV */
    assert(PWRLib_AppState == PWR_APP_STATE_ADV);

    offsetBeforeDsmExit = OFFSET_BEFORE_DSM_EXIT( wakeup_offset, osc_startup_delay);

#ifdef BOARD_DBG_ENABLE
    static int count = DUMP_EVERY_X_TIMES;
    if (--count==0)
    {
        DBG_LOG_DUMP(FALSE);
        count = DUMP_EVERY_X_TIMES;
    }
#endif

    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);

    enterLowPower = PWR_CheckBLE_LL_state(&nextInstant, &isLinkLayerAwake, offsetBeforeDsmExit);

    if(enterLowPower)
    {
#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1) && \
    defined(gPWR_UsePswitchMode_d) && (gPWR_UsePswitchMode_d == 1)
        if(gPWRLib_RamSavedStatus == PWRLIB_RAM_SAVED)
        {
            mPWR_DeepSleepTimeMs = 10U;
            PWR_HandleDeepSleepMode();
        }
#endif

        uint32_t rsimCtrl;
        bool     lowpower_skipped;
        bool_t   abort = FALSE;

        /* For now, isLinkLayerAwake shall always be set */
        assert(isLinkLayerAwake);

        //PWR_DBG_LOG("Sleep [%d] next=%d cur=%d", mPWRLib_DeepSleepMode, nextInstant, BLE_LL_REG(TIM_COUNTER_L));

        /* set DSM configuration  */
        BLE_LL_REG(WAKEUP_CONFIG) = ( WAKEUP_CFG_OSC_STARTUP_DELAY(wakeup_offset, osc_startup_delay)
                                         | BLE_LL_WAKEUP_CONFIG_CON_RAM_DSM_RET );

        /* No wakeup from LL - same as mode 5 */
        BLE_LL_REG(CLOCK_CONFIG)  = BLE_LL_CLOCK_CONFIG_LP_MOD_5;

        /* Time for LL to enter DSM now since all LL registers have been set up */
        abort = PWRLib_BLL_EnterDSM();

