N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
        if (abort == FALSE)
        {
#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
            /* Make sure NVM module has completed all pending operations before
               shutting down the RAM */
            NvCompletePendingOperations();
            /* in case of RAM OFF, we need to dump the trace immediatly */
            DBG_LOG_DUMP(FALSE);
#endif

            BOARD_EnterLowPowerCb();

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
            /* Disable SysTick counter and interrupt */
            uint32_t sysTickCtrl = SysTick->CTRL & ( SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
            SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
#endif

#if (gTMR_EnableLowPowerTimers_d)
            lptmrFreq = PWR_ProgramDeepSleepTime();

            /* If more low power timers are running, stop the hardware timer
            * and save the spend time in ticks that wasn't counted.        */
            notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif /* (gTMR_EnableLowPowerTimers_d) */

            /* set LLWU wakeup sources */
            LLWU->ME = gPWRLib_LLWU_WakeupModuleEnable_Radio_c | gPWRLib_LLWU_WakeupModuleEnable_LPTMR_c;

            /* set RSIM for low power mode */
            rsimCtrl = RSIM->CONTROL;
            rsimCtrl &= ~( RSIM_CONTROL_RF_OSC_EN_MASK | RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK);
            RSIM->CONTROL = rsimCtrl | RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK ;

            lowpower_skipped = PWRLib_MCU_Enter_vlls2_3();

            /* Reenable 32Mhz oscillator
              usually done in SystemInitHookWarm(), However, if the WFI has been skipped (no lowpower entry)
              It is mandatory to enable it again here for Radio ReInit and linkLayer wakeup */
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 1U);

            BOARD_DBGLPIOSET(3,0);
            /* No need to reinitialize the peripherals if the lowpower has been skipped */
            if ( lowpower_skipped == FALSE )
            {
                BOARD_ExitLowPowerVllsCb();
            }
            else
            {
                /* give some time for LL to be fully in DSM mode, otherwise, it will ignore the SW wakeup request */
                PWR_AddWaitTime(cPWR_WaitLlDelayOnLateIrq);
            }

            BOARD_ExitLowPowerCb();
            BOARD_DBGLPIOSET(3,1);

            PWRLib_LLWU_UpdateWakeupReason();

#if (gTMR_Enabled_d)
            /* Initialize the timer */
            TMR_ExitLowPower();
#endif

#if (gTMR_EnableLowPowerTimers_d)

            PWRLib_LPTMR_ClockStop();

            /* Sync. the low power timers - this makes the Timer task in ready state*/
            PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif /* (gTMR_EnableLowPowerTimers_d) */

            BOARD_DBGLPIOSET(3,0);
            /* can be used to measure vbat at wake up */
            DCDC_ExitLowPowerPostCb();
            BOARD_DBGLPIOSET(3,1);

            /* Note : 32MHz oscillator already been started in warm main */
#if !defined(gPWR_RamOffDuringAdv_d) || (gPWR_RamOffDuringAdv_d == 0)
            /* can't do a lot, wait now for 32MHz osc to be ready before initializing the radio */
            PWR_WaitFor32MhzReady();

            /* Increase the core frequency to speed up the ADV timming as the FLL already ON */
            BOARD_SetCoreClock48Mhz();
#endif

            /* Check if BLE LL exits DSM - Otherwise , force a wakeup now, this will take a while
               Warning : In case the device did not get to VLLS  (WFI skipped due to late interrupt)
                   wakeup of Link layer shall be requested after 32Mhz clock is ready */
            if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_INT) == 0U)
            {
                /* Radio will wait for 32Mhz during reinit so this can be done only
                     before SW request LL to wakeup */
                PWR_WaitFor32MhzReady();

                BOARD_DBGLPIOSET(5,0);
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT, 1U);
                BOARD_DBGLPIOSET(5,1);
            }

            /* Init RF */
            BOARD_DBGLPIOSET(0,0);
            Controller_RadioInit();
            BOARD_DBGLPIOSET(0,1);

            BOARD_DBGLPIOSET(4,0);
            PWRLib_BLL_WaitForDSMExit();
            BOARD_DBGLPIOSET(4,1);

#if defined(PWR_Mode9AdvOnLPTimerOnly) && (PWR_Mode9AdvOnLPTimerOnly == 1)
            /* Restart ADV on lowpower timer expiration only */

            /* Normal wakeup if wakeup source is not LPTMR  */
            if ( PWRLib_MCU_WakeupReason.Bits.FromLPTMR != 1u )
            {
                /* Restore BLE LL context */
                BOARD_DBGLPIOSET(4,0);
                Controller_RestoreLlhState();
                Controller_RestoreLlhStateComplete();

                PWRLib_ClearRSIMInt();

                /* set low power time to trigger next planned ADV at the expected moement  */
                /* need to take into account time already spent in low power since last ADV event */
                /* PWR_GetLastSleepDurationMS returns time spent on last low power sequence and is reset at each wakeup */
                mPWR_DeepSleepTimeMs -= PWR_GetLastSleepDurationMS();

                /* Reset LL DSM timer */
                RSIM->DSM_CONTROL |= RSIM_DSM_CONTROL_DSM_TIMER_CLR_MASK;
            }
            else
            {
                /* Restart ADV if wakeup source is LPTMR */

                /* set deep sleep time for low power timer to ADV interval
                    as it could have been modified since wakeup from other sources*/
                mPWR_DeepSleepTimeMs = mPWR_AdvdeepSleepTimeMode9Ms;

                PWR_BLE_LL_ResetRestartAdv();

                PWRLib_BLPItoBPE();

                PWRLib_ClearRSIMInt();

                /* reset DSM_EXIT flag */
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT, 0);
            }
#else
            /* Restart ADV on any wakeup */
            PWR_BLE_LL_ResetRestartAdv();

