N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
            PWRLib_BLPItoBPE();

            PWRLib_ClearRSIMInt();

            /* reset DSM_EXIT flag */
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT, 0);
#endif

#if defined(PWR_EnableRtosSysticks) && (PWR_EnableRtosSysticks == 1)
            SysTick->CTRL |= sysTickCtrl;
#endif

            if ( lowpower_skipped == FALSE )
            {
                BOARD_DBGLPIOSET(3,0);
                BOARD_ExitLowPowerVllsPostCb();
                BOARD_DBGLPIOSET(3,1);

                PWR_ProcessWakeupReason();
            }
            else
            {
                 /* In case of early wakeup due to late interrupt, event will be handled directly from the ISR */
                 PWRLib_MCU_WakeupReason.AllBits = 0;
            }

            PWRLib_BPEtoBLPE();

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
            if ( lowpower_skipped == FALSE )
            {
                BOARD_DBGLPIOSET(2,0);
                /* refresh NVM Ram values from Flash */
                NvModuleReInit();

#if defined(gPWR_RamOffRestoreBonding_d) && (gPWR_RamOffRestoreBonding_d == 1)
                /* restore database */
                PWR_RestoreBondingFromRamOff();
                BOARD_DBGLPIOSET(2,1);
#endif
            }
#endif
        }
    }

    BOARD_DBGLPIOSET(0,0);
    BOARD_DBGLPIOSET(2,1);
#else
    PWRLib_MCU_WakeupReason.AllBits = 0;
#endif /* cPWR_BLE_LL_Enable */
}
#endif /* (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_9) */

#if (cPWR_UsePowerDownMode)
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_9)
#if defined(gPWR_RamOffDuringAdv_d)             && (gPWR_RamOffDuringAdv_d == 1)
#if defined(gPWR_RamOffRestoreBonding_d)        && (gPWR_RamOffRestoreBonding_d == 1)
static void PWR_RestoreBondingFromRamOff(void)
{
    //uint8_t bonded_device_nb;

    /* Refresh bonding and database from NVM */
extern bleResult_t DevDb_Init(void);
    DevDb_Init();

    //Gap_GetBondedDevicesCount(&bonded_device_nb);
    //PWR_DBG_LOG("%d bonded devices\n", bonded_device_nb);
}
#endif
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_BLE_LL_ResetRestartAdv
 *---------------------------------------------------------------------------*/
static void PWR_BLE_LL_ResetRestartAdv(void)
{
    /* No need to wakeup the LLH, reset it to save time */
    BOARD_DBGLPIOSET(1,0);
    Controller_ResetLlhState();
    BOARD_DBGLPIOSET(1,1);

    /* Restore BLE LL context */
    BOARD_DBGLPIOSET(0,0);
    Controller_RestoreLlhState();
    BOARD_DBGLPIOSET(0,1);

    /* program ADV for next slot */
    Controller_UpdateLlhAdvInstant(1u);

    /* Complete the LLH restore and update */
    Controller_RestoreLlhStateComplete();
}
#endif /* (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_9) */
#endif /* #if (cPWR_UsePowerDownMode) */

/*---------------------------------------------------------------------------
 * Name: PWR_ProgramDeepSleepTime
 * Description: Program the next DeepSleep wakaup time
 * Parameters: -
 * Return: - LPTMR frequency in Hz
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode)
static uint32_t PWR_ProgramDeepSleepTime(void)
{
    uint8_t  clkMode;
    uint32_t lptmrTicks;
    uint32_t lptmrFreq;
    uint32_t sleepTimeMs;

    /* Get the expired time of the first programmed Low Power Timer */
    sleepTimeMs = TMR_GetFirstExpireTime(gTmrLowPowerTimer_c);

    /* check if it overtakes the maximum allowed deep sleep time */
    if(mPWR_DeepSleepTimeMs < sleepTimeMs)
    {
        sleepTimeMs = mPWR_DeepSleepTimeMs;
    }

    PWRLib_LPTMR_GetTimeSettings(sleepTimeMs ,&clkMode ,&lptmrTicks, &lptmrFreq);
    PWRLib_LPTMR_ClockStart(clkMode,lptmrTicks);

    //PWR_DBG_LOG("%u", sleepTimeMs);

    return lptmrFreq;
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_SyncTimers
 * Description: Synchronize the framework timers with the amount of time in LP
 * Parameters: - notCountedTicksBeforeSleep:
 *             - lptmrFreq:
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode) && (gTMR_EnableLowPowerTimers_d)
static void PWR_SyncTimers(uint32_t notCountedTicksBeforeSleep, uint32_t lptmrFreq)
{
    uint32_t timerTicks;
    uint64_t timerTicks_new;

    /* Update mLpmTotalSleepDuration for later usage by PWR_GetTotalSleepDurationMS() */
    //PWR_DBG_LOG("notCountedTicksBeforeSleep=%u lptmrFreq=%u", notCountedTicksBeforeSleep, lptmrFreq);

    timerTicks = PWRLib_LPTMR_ClockCheck();

    mLpmLastSleepDuration = ((uint64_t)timerTicks) * 1000000U / lptmrFreq;
    mLpmTotalSleepDuration      += mLpmLastSleepDuration;

    //PWR_DBG_LOG("mLpmTotalSleepDuration_new=%u", (uint32_t)mLpmTotalSleepDuration_new);
    //PWR_DBG_LOG("mLpmTotalSleepDuration=%u", (uint32_t)mLpmTotalSleepDuration);

    /* Calculate number of ticks for next wakeup */
    timerTicks_new = ((uint64_t)timerTicks * TMR_GetTimerFreq()) / lptmrFreq;
    //PWR_DBG_LOG("old=%d conv=%d", timerTicks, timerTicks_new);

#if !defined(PWRLib_LPTMR_KEEP_RUNNING)
    /* when lptmr keeps on running, there is no need to count missing ticks */
    timerTicks_new += notCountedTicksBeforeSleep;
#endif

    //PWR_DBG_LOG("timerTicks_new=%u ", timerTicks_new);

    TMR_SyncLpmTimers((uint32_t)timerTicks_new);
    TMR_MakeTMRThreadReady();
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_CheckBLE_LL_state
 * Description: Checks whether the BLE link layer allows to enter low power state
 * Parameters: - nextInstant : time to next instant
 *             - requireDsmEntry: TRUE if manual LL DSM entry is required
 *             - offsetBeforeDsmExit
 * Return: - enterLowPower: TRUE if low power mode alowed
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode) && (cPWR_BLE_LL_Enable)

static bool_t PWR_CheckBLE_LL_state(uint16_t * nextInstant, bool_t * requireDsmEntry, uint16_t offsetBeforeDsmExit)
{
    bool_t enterLowPower = FALSE;
    *requireDsmEntry     = FALSE;

    if( RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_STAT) != 0U) /* If false it means that BLE_LL is already in DSM */
    {
        if( (BLE_LL_REG(CLOCK_CONFIG) & BLE_LL_CLOCK_CONFIG_LLH_IDLE_MASK) != 0U)
        {
            uint16_t distanceToNextInstant;

            /* Get nextInstant and distanceToNextInstant from LL */
            distanceToNextInstant = Controller_GetNextInstance(nextInstant, &mLPMNoIdleIntr);
            //PWR_DBG_LOG("%d %d %d", distanceToNextInstant, *nextInstant, offsetBeforeDsmExit + 3);

            if(distanceToNextInstant > offsetBeforeDsmExit + 3U)
            {
                if(VECTOR_PENDING == 0U)
                {
                    /* can enter lowpower and require DSM exit - nextInstant is up to date */
                    *requireDsmEntry = TRUE;
                    enterLowPower   = TRUE;
                }
            }
        }
    }
    else
    {
        if (VECTOR_PENDING == 0U)
        {
            /* no interrupt pending, LL already in deep sleep, => can enter lowpower */
            enterLowPower        = TRUE;
        }
    }

    return enterLowPower;
}
#endif


