N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleep
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode)
static void PWR_HandleDeepSleep(void)
{
    PWRLib_MCU_WakeupReason.AllBits = 0U;

    if(mPWRLib_DeepSleepMode != PWR_LOWPOWER_INVALID_MODE)
    {

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
        uint8_t resLpMode = mPWRLib_DeepSleepMode;

        if ( ((PWRLib_AppState == PWR_APP_STATE_CONN) || (PWRLib_AppState == PWR_APP_STATE_INVALID))
                  && (mPWRLib_DeepSleepMode == PWR_LOWPOWER_VLLS2_3_LL_DSM3_MODE)  )
        {
            bool_t power_gating_allowed = Controller_IsPowerGatingAllowed();

            /* In VLLS connected mode, check if the LL allows to go to power gating mode */
            if ( power_gating_allowed == FALSE )
            {
                /* power gating disabled, => Switch to LLS */
                 mPWRLib_DeepSleepMode = PWR_LOWPOWER_LLS2_3_LL_DSM_MODE;
            }
        }
#endif

        assert( maHandleDeepSleep[mPWRLib_DeepSleepMode - 1U] != 0U);
        maHandleDeepSleep[mPWRLib_DeepSleepMode - 1U]();

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
        /* restore to previous value if it was changed */
        mPWRLib_DeepSleepMode   = resLpMode;
#endif
    }
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleSleep
 *---------------------------------------------------------------------------*/
#if ( !defined(cPWR_EnableDeepSleepMode_6) || (cPWR_EnableDeepSleepMode_6 == 0) ) || \
    ( !defined(cPWR_UsePowerDownMode) || (cPWR_UsePowerDownMode == 0) )
static PWRLib_WakeupReason_t PWR_HandleSleep(void)
{
    PWRLib_WakeupReason_t  Res;

    Res.AllBits = 0U;
    PWRLib_MCU_WakeupReason.AllBits = 0U;

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1) && \
    defined(cPWR_UsePowerDownMode) && (cPWR_UsePowerDownMode == 1)

    /* We enable LL interrupts to leave sleep mode when LL idles so we can try to go
     * into deeper sleep mode */
    PWRLib_BLL_EnableInterrupts(BLE_LL_EVENT_ENABLE_LLH_IDLE_INT_MASK);
    BLE_LL_REG(CLOCK_CONFIG) = BLE_LL_CLOCK_CONFIG_DEFAULT;

#endif

    PWRLib_MCU_Enter_Sleep();

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1) && \
    defined(cPWR_UsePowerDownMode) && (cPWR_UsePowerDownMode == 1)

    /* check if Sleep mode exit was on LL interrupt */
    if(BLE_LL_REG_EVENT_STATUS & BLE_LL_EVENT_STATUS_LLH_IDLE_INT_MASK )
    {
        PWRLib_BLL_ClearInterrupts(BLE_LL_EVENT_ENABLE_LLH_IDLE_INT_MASK);
    }
    PWRLib_BLL_DisableInterrupts(BLE_LL_EVENT_ENABLE_LLH_IDLE_INT_MASK);

#endif

    Res.Bits.SleepTimeout = 1U;
    PWRLib_MCU_WakeupReason.Bits.SleepTimeout = 1U;

    return Res;
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_DeepSleepAllowed
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode) && ( !defined(PWR_DisableDeepLowpower) || (PWR_DisableDeepLowpower == 0) )
static bool_t PWR_DeepSleepAllowed(void)
{
    bool_t state = TRUE;

    if(mLpmXcvrDisallowCnt != 0U)
    {
        state = FALSE;
    }

    return state;
}
#endif /* #if (cPWR_UsePowerDownMode)*/


/*****************************************************************************
 *                             PUBLIC FUNCTIONS                              *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions that have global (project) scope.   *
 * These functions can be accessed outside this module.                      *
 * These functions shall have their declarations (prototypes) within the     *
 * interface header file and shall be preceded by the 'extern' keyword.      *
 *---------------------------------------------------------------------------*
 *****************************************************************************/

/*---------------------------------------------------------------------------
 * Name: PWR_Init
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_Init(void)
{
#if (cPWR_UsePowerDownMode)
#if defined(USE_RTOS) && (USE_RTOS)
#if !defined(PWR_EnableRtosSysticks) || (PWR_EnableRtosSysticks == 0)
    /* Disable systick */
    SysTick->CTRL = 0U;
#endif
#endif

#if cPWR_EnableDeepSleepMode_8 || cPWR_EnableDeepSleepMode_5 || cPWR_EnableDeepSleepMode_9
    warmbootConfig.doWarmbootSequence = WARMBOOT_SEQUENCE;
#else
    warmbootConfig.doWarmbootSequence = 0U;
#endif
    warmbootConfig.useWarmbootSp      = USE_WARMBOOT_SP;

    PWRLib_Init();
#endif /* (cPWR_UsePowerDownMode) */
}

/*---------------------------------------------------------------------------
 * Name: PWR_GetSystemResetStatus
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
uint16_t PWR_GetSystemResetStatus(void)
{
    uint16_t resetStatus = 0U;

    resetStatus = (uint16_t)(RCM_REG->SRS0);
    resetStatus |= ((uint16_t)(RCM_REG->SRS1)) << 8;

    return resetStatus;
}

#if defined(PWR_FUNCTION_NOT_USED)
/*---------------------------------------------------------------------------
 * Name: PWR_SystemReset
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_SystemReset(void)
{
    SCB->AIRCR = (0x5FAUL << SCB_AIRCR_VECTKEY_Pos) | SCB_AIRCR_SYSRESETREQ_Msk;
    while(0 == 0)
    {

    }
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_SetDeepSleepTimeInMs
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_SetDeepSleepTimeInMs(uint32_t deepSleepTimeMs)
{
#if (cPWR_UsePowerDownMode) && (cPWR_BLE_LL_Enable)
    if(deepSleepTimeMs != 0U)
    {
        mPWR_DeepSleepTimeMs = deepSleepTimeMs;
#if defined(PWR_Mode9AdvOnLPTimerOnly) && (PWR_Mode9AdvOnLPTimerOnly == 1)
        mPWR_AdvdeepSleepTimeMode9Ms = deepSleepTimeMs;
#endif
    }
    else
    {
        (void)deepSleepTimeMs;
    }
#else
    (void)deepSleepTimeMs;
#endif /* (cPWR_UsePowerDownMode) */
}

