N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
/*---------------------------------------------------------------------------
 * Name: PWR_LVD_ReportLevel
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
PWRLib_LVD_VoltageLevel_t PWR_LVD_ReportLevel(void)
{
    PWRLib_LVD_VoltageLevel_t Level;

#if ((cPWR_LVD_Enable == 0) || (cPWR_LVD_Enable == 3))
    Level = PWR_ABOVE_LEVEL_3_0V;
#elif (cPWR_LVD_Enable == 1)
    Level = PWRLib_LVD_CollectLevel();
#elif (cPWR_LVD_Enable == 2)
    Level = PWRLib_LVD_SavedLevel;
#else
#error "*** ERROR: Illegal value for cPWR_LVD_Enable"
#endif /* (cPWR_LVD_Enable) */
    return Level;
}

/*---------------------------------------------------------------------------
 * Name: PWR_EnterLowPower
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
PWRLib_WakeupReason_t PWR_EnterLowPower(void)
{
    PWRLib_WakeupReason_t ReturnValue;
    ReturnValue.AllBits = 0;

#if (cPWR_UsePowerDownMode)

    BOARD_DBGLPIOSET(0,0);

    //DBG_LOG_DUMP(FALSE);

    OSA_InterruptDisable();

#if USE_RTOS == 0
    if(!OSA_TaskShouldYield())
    {
#endif

#if ((cPWR_LVD_Enable == 1) || (cPWR_LVD_Enable == 2))
        if(PWR_LVD_ReportLevel() == PWR_LEVEL_CRITICAL)
        {
            /* Voltage <= 1.8V so enter power-off state - to disable false Tx'ing(void)*/
            PWR_EnterPowerOff();
            /* if the above function returns, the function does nothing, and no lowpower was entered
               return 0 */
        }
#endif

#if !defined(PWR_DisableDeepLowpower) || (PWR_DisableDeepLowpower == 0)
        if ( TMR_AreAllTimersOff())  /*No timer running*/
        {
            if( PWR_DeepSleepAllowed())
            {
                PWR_HandleDeepSleep();
                ReturnValue = PWRLib_MCU_WakeupReason;
            }
        }
        else
        {
            //PWR_DBG_LOG("Timer ON [%d]", mPWRLib_DeepSleepMode);
        }
#endif

        /* if no lowpower entered, go to Stop or Sleep mode */
        if ( ReturnValue.AllBits == 0U )
        {
#if (cPWR_EnableDeepSleepMode_6 == 1)
            uint8_t lpMode = mPWRLib_DeepSleepMode;
            mPWRLib_DeepSleepMode = 6U;
            PWR_HandleDeepSleep();
            mPWRLib_DeepSleepMode = lpMode;
#else
            ReturnValue = PWR_HandleSleep();
#endif
        }

#if USE_RTOS == 0
    }
#endif

    OSA_InterruptEnable();

    BOARD_DBGLPIOSET(0,1);

    return ReturnValue;
#else
    ReturnValue = PWR_HandleSleep();
    return ReturnValue;
#endif
}

/*---------------------------------------------------------------------------
 * Name: PWR_RegisterLowPowerEnterCallback
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_RegisterLowPowerEnterCallback(pfPWRCallBack_t lowPowerEnterCallback)
{
}

/*---------------------------------------------------------------------------
 * Name: PWR_RegisterLowPowerExitCallback
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_RegisterLowPowerExitCallback(pfPWRCallBack_t lowPowerExitCallback)
{
}

/*---------------------------------------------------------------------------
 * Name: PWR_EnterSleep
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_EnterSleep(void)
{
    PWRLib_MCU_Enter_Sleep();
}

/*---------------------------------------------------------------------------
* Name: PWR_GetTotalSleepDurationMS
* Description: -
* Parameters: -
* Return: -
*---------------------------------------------------------------------------*/
uint32_t PWR_GetTotalSleepDurationMS(void)
{
    uint32_t time;

    OSA_InterruptDisable();
    time = (uint32_t) (mLpmTotalSleepDuration / 1000ULL);
    OSA_InterruptEnable();

    return time;
}

/*---------------------------------------------------------------------------
* Name: PWR_ResetTotalSleepDuration
* Description: -
* Parameters: -
* Return: -
*---------------------------------------------------------------------------*/
void PWR_ResetTotalSleepDuration(void)
{
    OSA_InterruptDisable();
    mLpmTotalSleepDuration = 0;
    OSA_InterruptEnable();
}

/*---------------------------------------------------------------------------
 * Name: PWR_GetWakeupReason
 * Description: -
 * Parameters: -
 * Return: - Wakeup reason
 *---------------------------------------------------------------------------*/
PWRLib_WakeupReason_t PWR_GetWakeUpReason(void)
{
    return PWRLib_MCU_WakeupReason;
}

/*---------------------------------------------------------------------------
 * Name: PWR_GetAppState
 * Description: - Provide the application state
 * Parameters: -
 * Return: - application state
 *---------------------------------------------------------------------------*/
PWR_AppState PWR_GetAppState(void)
{
    return PWRLib_AppState;
}

/*---------------------------------------------------------------------------
 * Name: PWR_SetNewAppState
 * Description: - Provide the application lowpower mode so the lowpower module
 *                could match to the most appropriate lowpower mode
 * Parameters: -  app_state
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_SetNewAppState(PWR_AppState app_state)
{
#if (cPWR_UsePowerDownMode)
    uint8_t lpMode;

    if(app_state < PWR_APP_STATE_INVALID)
    {
        lpMode = pwr_app_state_to_lowpower_state[app_state];
        PWRLib_AppState = app_state;
        (void)PWR_ChangeDeepSleepMode(lpMode);
    }
    //PWR_DBG_LOG("%d", mPWRLib_DeepSleepMode);
#else
    (void)app_state;
#endif
}

/*---------------------------------------------------------------------------
 * Name: PWR_SetWakeupPins
 *---------------------------------------------------------------------------*/
void PWR_SetWakeupPins(uint32_t wkup_pin_set)
{
#if (cPWR_UsePowerDownMode)
    /* Set that the wakeup pins have been configured */
    PWRLib_wkup_pin_setup |= wkup_pin_set;

