N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWR.c
    PWRLib_SetWakeupPins(PWRLib_wkup_pin_setup);
#else
    (void)wkup_pin_set;
#endif
}

/*---------------------------------------------------------------------------
 * Name: PWR_UnSetWakeupPins
 *---------------------------------------------------------------------------*/
void PWR_UnSetWakeupPins(uint32_t wkup_pin_unset)
{
#if (cPWR_UsePowerDownMode)
    LLWU->PE1 &= ~( (uint8_t)(wkup_pin_unset    ) & 0xFFU);
    LLWU->PE2 &= ~( (uint8_t)(wkup_pin_unset>>8 ) & 0xFFU);
    LLWU->PE3 &= ~( (uint8_t)(wkup_pin_unset>>16) & 0xFFU);
    LLWU->PE4 &= ~( (uint8_t)(wkup_pin_unset>>24) & 0xFFU);

#if defined(gSerialManagerMaxInterfaces_c) && (gSerialManagerMaxInterfaces_c > 0)
    for (uint32_t i = 0U; i < 32U; i += 2U)
    {
        /* need to shift the 16 wakepins 2bit field into a 16bit field to match the
           LLWU wakeup source detect register                          */
        if ( ((wkup_pin_unset >> i) & 0x3U) != 0U )
        {
            /* clear the corresponding bit in the bitmap */
            pwr_llwu_serial_bitmap &= ~((uint32_t)0x1U << (i>>1U));
        }
    }
#endif
#else
    (void)wkup_pin_unset;
#endif
}

/*---------------------------------------------------------------------------
 * Name: PWR_SetWakeupPinsSerial
 *---------------------------------------------------------------------------*/
void PWR_SetWakeupPinsSerial(uint32_t serial_wkup_pin_set, uint8_t serial_interface)
{
#if (cPWR_UsePowerDownMode) && defined(gSerialManagerMaxInterfaces_c) && (gSerialManagerMaxInterfaces_c > 0)
    assert(serial_interface < gSerialManagerMaxInterfaces_c);

    PWR_SetWakeupPins( serial_wkup_pin_set );

    pwr_serial_interface             = serial_interface;

    for (uint32_t i = 0U; i < 32U; i += 2U)
    {
        /* need to shift the 16 wakepins 2bit field into a 16bit field to match the
           LLWU wakeup source detect register                          */
        if ( ((serial_wkup_pin_set >> i) & 0x3U) != 0U )
        {
              pwr_llwu_serial_bitmap |=  (uint32_t)0x1U << (i>>1U);
        }
    }
#else
    (void)serial_wkup_pin_set;
    (void)serial_interface;
#endif
}


/*---------------------------------------------------------------------------
 * Name: PWR_ClearRSIMDsmInt
 * Description:
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable))
bool_t PWR_ClearRSIMDsmInt(void)
{
    return PWRLib_ClearRSIMDsmInt();
}
#endif


